// Все регистры в процессоре
// ---------------------------------------------------------------------
reg [ 7:0]  A           = 8'h00;    // Аккумулятор
reg [ 7:0]  X           = 8'hF0;    // Индексный X
reg [ 7:0]  Y           = 8'hFF;    // Индексный Y
reg [ 7:0]  S           = 8'h00;    // Стек
reg [ 7:0]  P           = 8'h00;    // Флаги
reg [15:0]  pc          = 16'h0000; // Счетчик инструкции
// ---------------------------------------------------------------------
reg [ 4:0]  T           = 5'h0;     // 0..31 Текущая линия выполнения на верилог
reg         sel         = 1'b0;     // Выбор источника адреса в память
reg [15:0]  cursor      = 16'h0000; // Указатель в память
reg [ 7:0]  opcode      = 8'h00;    // Сохраненный опкод
reg [ 7:0]  tmpb        = 8'h00;    // Временный байт
// ---------------------------------------------------------------------
wire [ 7:0] azpx        = i_data + X;
wire [ 7:0] azpy        = i_data + Y;
wire [ 7:0] cursor8     = cursor + 1'b1;
// ---------------------------------------------------------------------

localparam
    RST     = 0,
    ZP      = 1,
    ZPX     = 2,
    ZPY     = 3,
    ABS     = 4,  // 5
    ABX     = 6,  // 7
    ABY     = 8,  // 9
    NDX     = 10, // 11,12
    NDY     = 13, // 14,15
    REL     = 15,
    IMM     = 16,
    IMP     = 17,
    ACC     = 17;
